Revit 2026 API

# EdgeReference Property

---

Returns a stable reference to the edge.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference Reference { get; }
```
```vb
Public ReadOnly Property Reference As Reference
	Get
```
```cpp
public:
property Reference^ Reference {
	Reference^ get ();
}
```
```fsharp
member Reference : Reference with get
```

#### Property Value

Reference

This value is if the corresponding geometry object does not permit referencing.

#### Reference

Edge Class

Autodesk.Revit.DB Namespace